public class HW5_1 {

    public static void main(String[] args) {

        /**
         * Задача №1
         * Необходимо написать 4 метода:
         * сложение 2х чисел
         * вычитание 2х чисел
         * умножение 2х чисел
         * деление 2х чисел
         */

        HWdopClass5_1 HW5_1 = new HWdopClass5_1 ();

        System.out.println(HW5_1.sum(6, 2));
        System.out.println(HW5_1.minus(6, 2));
        System.out.println(HW5_1.multiplay(6, 2));
        System.out.println(HW5_1.dev(6, 2));

        /**
         *
         */

    }
}
