public class рпрпр {
    public static void main(String[] args) {
        System.out.println(Task7(1, 3, 4, 6));
    }

    //Task # 7
    // Написать метод, который принимает на вход 5 целых чисел,
    // и возвращает массив из этих же чисел
    public static int[] Task7(int a, int b, int c, int d) {
        int[] arr = {a, b, c, d};
        return arr;
    }
}